posts/2019-01-30-emacs-orglink/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Org-Mode Links Are Fun</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Emacs Org-Mode Links Are Fun</h1>
</header><p>
I have started to use a few of org-mode's link features to help me stay
organized in my job. The top of my "main" org file now includes these
statements:
</p>

<div class="org-src-container">
<pre class="src src-org">#+LINK: issue https://company.issue.tracker.com/ticket?id=
#+LINK: tree elisp:(neotree-dir "%s")
#+LINK: dir elisp:(setq default-directory "%s")
</pre>
</div>

<p>
Now I can write outlines that look something like this:
</p>

<div class="org-src-container">
<pre class="src src-org">* [[tree:D:/Projects/SomeProject][Some Project]]

** [[issue:42][Major Bug]]

I have taken these steps to narrow the possible causes:

- foo
- bar
- fizz
</pre>
</div>

<p>
The topmost headline can now give me a tree view of the "Some Project"
directory, while the second headline opens a particular ticket in my default
browser.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2019-01-30</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>
